# ex3-4.py
# 연습문제
# 자판기 프로그램(무한루프)을 작성하시오.
# 사용자가 1을 입력하면, "콜라가 나옵니다"
# 2를 입력하면 "사이다가 나옵니다"
# 3을 입력하면 "오렌지쥬스가 나옵니다"
# 콜라의 잔고는 3개
# 사이다의 잔고는 2개
# 오렌지의 잔고는 4개 입니다.
# 잔고 소진시 "콜라(사이다,오렌지쥬스) 잔고가 떨어졌습니다." 라고 출력하시오.

# 연습문제
# 텍스트 야구게임(무한루프)을 작성하시오.
# 투수는 공을 던지는데, 스트라이크 확률이 70%이고, 볼 확률이 30%입니다.
# 투수가 공을 계속 던졌을 때 볼 카운트(스트라이크와 볼)을 출력하시오.
# 확률은 rand.randint()함수를 이용합니다.
# 출력 예시
# 1번 송구: 스트라이크   - 1스트라이크 0볼
# 2번 송구: 볼          - 1스트라이크 1볼
# 3번 송구: 스트라이크  - 2스트라이트 1볼
# 4번 송구: 스트라이크   -3스트라이크 1볼 - 스트라이크 아웃!
# 게임끝

